# WallKeyRefParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..WallKeyRefParam Property
ParameterTypeId Class See Also
---
"Location Line"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId WallKeyRefParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WallKeyRefParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ WallKeyRefParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace